app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "DTN-7pXVjMdTY5BoF8y_QQ"], ["updated_at", "2019-07-29 20:49:57.903198"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = new_session_token
        self.save!